app/views/providers/edit.html.erb

SELECT "categories".* FROM "categories"
---
                <label>¿A qué categoría perteneces?</label>
                <%= f.collection_select(:category_id, Category.all, :id, :name, {}, { :class=> "form-control" }) %>

SELECT "locations".id FROM "locations" INNER JOIN "localizations" ON "locations"."id" = "localizations"."location_id" WHERE "localizations"."provider_id" = $1
---
              <% @locations_set_1.each do |location| %>
                <%= check_box_tag "provider[location_ids][]", location.id, @provider.location_ids.include?(location.id), id: dom_id(location), :onClick => "uncheckMain(this);", class: "location_cbx" %>