app/views/providers/home.html.erb

        <li>
          <%= link_to(category_path(Category.find_by(name: "Mantenimiento"))) do %>
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Mantenimiento' LIMIT 1

        <li>
          <%= link_to(category_path(Category.find_by(name: "Limpieza"))) do %>
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Limpieza' LIMIT 1

        <li>
          <%= link_to(category_path(Category.find_by(name: "Asistente Personal"))) do %>
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Asistente Personal' LIMIT 1

        <li>
          <%= link_to(category_path(Category.find_by(name: "Mudanza"))) do %>
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Mudanza' LIMIT 1