app/views/providers/index.html.erb

SELECT "locations".* FROM "locations"   ORDER BY "locations"."name" ASC
SELECT "categories".* FROM "categories"   ORDER BY "categories"."name" ASC
---
      <%= f.label :locations_id_eq, "Municipio:" %>
      <%= f.collection_select :locations_id_eq, Location.order(:name), :id, :name, {include_blank: "Todos"}, {class:"borderless form-location-nav"} %>
      <%= f.label :category_id_eq, "Servicio:" %>
      <%= f.collection_select :category_id_eq, Category.order(:name), :id, :name, {include_blank: "Todos"}, {class:"borderless form-servers-nav"} %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? ORDER BY "categories"."id" ASC LIMIT 1  [["id", 1]]
---
      <% if !params[:q].nil? && !params[:q][:category_id_eq].nil? && !params[:q][:locations_id_eq].nil? %>
        <p class="mt-49 mb-7 text-left">Mostrando proveedores de la categoría <span class="medium"><%= Category.find(params[:q][:category_id_eq].to_i).name %></span> para el municipio de <span><%= Location.find(params[:q][:locations_id_eq].to_i).name %>:</span></p>