app/controllers/providers_sessions_controller.rb

  def create
    @provider = Provider.find_by_email(params[:email])
---
SELECT  "providers".* FROM "providers"  WHERE "providers"."email" = '' LIMIT 1