app/controllers/providers_controller.rb

  def index
    # Get search form params
    session[:from_date]     = params[:from_date]
    session[:to_date]       = params[:to_date]

    session[:q_location]    = Location.find(params[:q][:locations_id_eq]).name rescue nil
    session[:q_location_id] = params[:q][:locations_id_eq] rescue nil

    if session[:from_date].to_s.length == 0 || session[:to_date].to_s.length == 0
      redirect_to '/'
    else

      if session[:q_location_id] == nil
        @providers = Provider.where(active: true)
        @providers = @providers.where(id: State.where(country_id: current_country).map{|state| state.locations.map{|location| location.providers.map{|provider| provider.id}}}.flatten) if current_country != nil
      else
        @location = Location.find(params[:q][:locations_id_eq]).name rescue ''
        @state_id = params[:states][:id] rescue nil
        @location_id = params[:locations][:id] rescue nil

        if !@state_id.to_s.empty?
          state = State.find(@state_id)
          @providers = Location.find(@location_id).providers if !@location_id.empty?
          @providers = Provider.where(id: state.locations.map{|location| location.providers.map{|provider| provider.id}}.flatten) if @location_id.empty?
          @providers = @providers.where(active: true) if @providers != nil
        else
          @providers = Provider.where(active: true)
        end
      end

      @search = Provider.search(params[:q])
---
SELECT "locations".* FROM "locations" INNER JOIN "localizations" ON "locations"."id" = "localizations"."location_id" WHERE "localizations"."provider_id" = ?  [["provider_id", 1]]
SELECT "providers".* FROM "providers" LEFT OUTER JOIN "localizations" ON "localizations"."provider_id" = "providers"."id" LEFT OUTER JOIN "locations" ON "locations"."id" = "localizations"."location_id" WHERE "locations"."id" = 2
SELECT COUNT(*) FROM "locations" INNER JOIN "localizations" ON "locations"."id" = "localizations"."location_id" WHERE "localizations"."provider_id" = $1  [["provider_id", 1]]
SELECT "locations".* FROM "locations"  WHERE "locations"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16)
SELECT "providers".* FROM "providers"

  def edit
    if current_provider != nil
      @provider_attachment = @provider.provider_attachments.build
      @new_provider_attachment = @provider.provider_attachments.new
      @provider_attachments = @provider.provider_attachments.all

      @provider = Provider.find(params[:id])
---
SELECT "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @provider = Provider.new(all_provider_params)
    @provider.active = false
    @provider.category_id = Category.find_by_name("Hotel").id

    if @provider.save
---
INSERT INTO "providers" ("category_id", "created_at", "dni", "email", "email_c", "last_name_1", "last_name_2", "name", "password_digest", "phone", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @provider = Provider.find(params[:id])

    if @provider.update_attributes(all_provider_params)
---
SELECT "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "providers" SET "category_id" = ?, "updated_at" = ? WHERE "providers"."id" = 4  [["category_id", 7], ["updated_at", Fri, 24 Oct 2014 19:01:35 UTC +00:00]]

  def set_provider
    @provider = Provider.find(params[:id])
---
SELECT "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT 1  [["id", "2"]]