app/controllers/providers_controller.rb

INSERT INTO "providers" ("category_id", "created_at", "dni", "email", "last_name_1", "last_name_2", "name", "password_digest", "phone", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @provider = Provider.new(provider_params)
      if @provider.save

SELECT  "providers".* FROM "providers"  WHERE "providers"."id" = $1 LIMIT 1
---
    def set_provider
      @provider = Provider.find(params[:id])

SELECT "locations".* FROM "locations"
---
    def get_ranges
      sets = Location.all.in_groups(3, false)