app/views/categories/show.html.erb

      <%= f.label :locations_id_eq, "Municipio:" %>
      <%= f.collection_select :locations_id_eq, Location.order(:name), :id, :name, {include_blank: "Todos"}, {class:"borderless form-location-nav"} %>
      <%= f.label :category_id_eq, "Servicio:" %>
      <%= f.collection_select :category_id_eq, Category.order(:name), :id, :name, {include_blank: "Todos", :selected => params[:id]}, {class:"borderless form-servers-nav"} %>
---
SELECT "locations".* FROM "locations"   ORDER BY "locations"."name" ASC
SELECT "categories".* FROM "categories"   ORDER BY "categories"."name" ASC