app/controllers/concerns/providers_sessions.rb

SELECT  "providers".* FROM "providers"  WHERE "providers"."id" = $1 LIMIT 1
---
  def current_provider
    @current_provider ||= Provider.find(session[:provider_id]) if session[:provider_id]